In [ ]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.tree import export_graphviz
 
# วัดประสิทธิภาพ
from sklearn.metrics import classification_report,confusion_matrix
from sklearn import metrics

In [ ]:
url = 'https://raw.githubusercontent.com/earth4950/examdataset/main/dataset%20python.csv'
df = pd.read_csv(url)
df.head()

   Case ID  Name  Social Security No.  Age  ...      Status Income   GPA   Class
0        1  John               123321   22  ...     Student   3000  3.22  Invite
1        2  Mary               343422   38  ...    Employee  32000  2.00  Invite
2        3   Ali               876345   46  ...    Employee  69000  2.90  Invite
3        4   Lee               673245   23  ...     Student   3500  3.10  Invite
4        5   Ted               451087   45  ...  Unemployed   5000  3.10   Don't

[5 rows x 9 columns]

In [ ]:
conversion_dict = {"Don't": 0, "Invite": 1,}
df['Class'] = df['Class'].replace(conversion_dict)
df.head()

   Case ID  Name  Social Security No.  Age  ...      Status Income   GPA  Class
0        1  John               123321   22  ...     Student   3000  3.22      1
1        2  Mary               343422   38  ...    Employee  32000  2.00      1
2        3   Ali               876345   46  ...    Employee  69000  2.90      1
3        4   Lee               673245   23  ...     Student   3500  3.10      1
4        5   Ted               451087   45  ...  Unemployed   5000  3.10      0

[5 rows x 9 columns]

In [ ]:
conversion_dict = {"Female": 0, "Male": 1,}
df['Sex'] = df['Sex'].replace(conversion_dict)
df.head()

   Case ID  Name  Social Security No.  Age  ...      Status Income   GPA  Class
0        1  John               123321   22  ...     Student   3000  3.22      1
1        2  Mary               343422   38  ...    Employee  32000  2.00      1
2        3   Ali               876345   46  ...    Employee  69000  2.90      1
3        4   Lee               673245   23  ...     Student   3500  3.10      1
4        5   Ted               451087   45  ...  Unemployed   5000  3.10      0

[5 rows x 9 columns]

In [ ]:
conversion_dict = {"Student": 1, "Employee": 2,"Unemployed":0}
df['Status'] = df['Status'].replace(conversion_dict)
df.head()

   Case ID  Name  Social Security No.  Age  Sex  Status  Income   GPA  Class
0        1  John               123321   22    1       1    3000  3.22      1
1        2  Mary               343422   38    0       2   32000  2.00      1
2        3   Ali               876345   46    1       2   69000  2.90      1
3        4   Lee               673245   23    1       1    3500  3.10      1
4        5   Ted               451087   45    1       0    5000  3.10      0

In [ ]:
# clean data

new_df = df.iloc[:,[0,2,3,4,5,6,7,8]]
new_df

    Case ID  Social Security No.  Age  Sex  Status  Income   GPA  Class
0         1               123321   22    1       1    3000  3.22      1
1         2               343422   38    0       2   32000  2.00      1
2         3               876345   46    1       2   69000  2.90      1
3         4               673245   23    1       1    3500  3.10      1
4         5               451087   45    1       0    5000  3.10      0
5         6               239847   19    1       1    1300  3.80      0
6         7               229951   23    0       1   12000  2.80      0
7         8               234819   33    0       0    5000  0.00      0
8         9               258199   32    1       1    1000  2.10      0
9        10               813672   20    1       1   32000  3.90      0
10       11               501184   23    0       1    6600  3.30      1
11       12               619458   40    1       0   35000  3.30      0
12       13               654397   31    0       0   14000  3.00      0
13       14               350932   59    1       2   29000  2.80      0
14       15               357922   33    1       2   19000  2.60      0

**Decision Tree**

In [ ]:
# Train Test 
x = new_df
y = df["Class"]

x_train , x_test , y_train , y_test = train_test_split(x,y , random_state =0 , test_size = 0.4)

In [ ]:
# Model Dicision Tree
from sklearn import tree
clf = tree.DecisionTreeClassifier(criterion = "entropy" , max_depth = 3 , min_samples_leaf = 5)
# Trainning Model
clf.fit(x_train , y_train)
y_predict = clf.predict(x_test)

In [ ]:
# เทียบค่า y_test vs y_predict
df_result = pd.DataFrame({'Actually': y_test , 'Predicted' : y_predict})
df_result

    Actually  Predicted
1          1          0
6          0          0
8          0          0
9          0          0
14         0          0
4          0          0

In [ ]:
# วัดผลโมเดล 
pd.crosstab(y_test,y_predict , rownames=["Actually"] , colnames=["Prediction"] , margins=True)

Prediction  0  All
Actually
0           5    5
1           1    1
All         6    6

In [ ]:
# Accuracy Score
Accuracy_DicisionTree = metrics.accuracy_score(y_test,y_predict)
print("Accuracy Score = " , Accuracy_DicisionTree)

Accuracy Score =  0.8333333333333334

**Random Forest**

In [ ]:
x = new_df
y = df["Class"]

x_train , x_test , y_train , y_test = train_test_split(x,y , random_state =0 , test_size = 0.4)

In [ ]:
# Model Random Forest
from sklearn.ensemble import RandomForestClassifier
m = RandomForestClassifier(n_estimators = 200 , min_samples_leaf = 3 , max_features=0.3 , oob_score = True)
m.fit(x_train , y_train)
y_predict = m.predict(x_test)

In [ ]:
# เทียบค่า y_test vs y_predict
Result = pd.DataFrame({'Actually': y_test , 'Predicted' : y_predict})
Result

    Actually  Predicted
1          1          0
6          0          0
8          0          0
9          0          0
14         0          0
4          0          0

In [ ]:
# วัดผลโมเดล
pd.crosstab(y_test,y_predict , rownames=["Actually"] , colnames=["Prediction"] , margins=True)

Prediction  0  All
Actually
0           5    5
1           1    1
All         6    6

In [ ]:
# Accuracy Score
Accuracy_RandomForest = metrics.accuracy_score(y_test,y_predict)
print("Accuracy Score = " , Accuracy_RandomForest )

Accuracy Score =  0.8333333333333334

**XGBOOST**

In [ ]:
# Train Test 
x = new_df
y = df["Class"]

x_train , x_test , y_train , y_test = train_test_split(x,y , random_state =0 , test_size = 0.4)

In [ ]:
# Model GradientBoostingClassifier
from sklearn.ensemble import GradientBoostingClassifier
w = GradientBoostingClassifier(n_estimators = 200 , min_samples_leaf = 3 , max_features=0.5)
w.fit(x_train , y_train)
y_predict = w.predict(x_test)

In [ ]:
# เทียบค่า y_test vs y_predict
Result2 = pd.DataFrame({'Actually': y_test , 'Predicted' : y_predict})
Result2

    Actually  Predicted
1          1          1
6          0          0
8          0          0
9          0          0
14         0          0
4          0          0

In [ ]:
# วัดผลโมเดล
pd.crosstab(y_test,y_predict , rownames=["Actually"] , colnames=["Prediction"] , margins=True)

Prediction  0  1  All
Actually
0           5  0    5
1           0  1    1
All         5  1    6

In [ ]:
# Accuracy Score
Accuracy_XGBoost = metrics.accuracy_score(y_test,y_predict)
print("Accuracy Score = " , Accuracy_XGBoost)

Accuracy Score =  1.0